#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Reading...
module.fourkeys.data.archive_file.load_gh_audit_log_source: Reading...
module.fourkeys.module.gcloud_build_batch_events_handler.data.external.env_override[0]: Reading...
module.fourkeys.module.test_artifact_registry_url_demo.data.external.env_override[0]: Reading...
module.fourkeys.module.gcloud_build_batch_events_handler.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.module.test_artifact_registry_url_demo.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.data.archive_file.load_gh_audit_log_source: Read complete after 0s [id=3e3b591035611305364327833ac77c3158d209d0]
module.fourkeys.data.archive_file.events_bq_writer_source: Reading...
module.fourkeys.data.archive_file.batch_events_handler_source: Reading...
module.fourkeys.data.archive_file.demo: Reading...
module.fourkeys.data.archive_file.demo: Read complete after 0s [id=6c1bb5ba27bd83aabb22cffba9470a9ca91073b6]
module.fourkeys.data.archive_file.events_bq_writer_source: Read complete after 0s [id=6f2d6c347b7f4e8eba5d12946eda38b1d84b2af7]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_destroy_command[0]: Refreshing state... [id=7501264970071068882]
module.fourkeys.module.test_artifact_registry_url_demo.null_resource.run_command[0]: Refreshing state... [id=6469184184091429422]
module.fourkeys.data.archive_file.batch_events_handler_source: Read complete after 0s [id=d2c3770ca6aa2cb76ae14c2c515a686517dcc6ff]
module.fourkeys.module.test_artifact_registry_url_demo.null_resource.run_destroy_command[0]: Refreshing state... [id=795832857450092111]
module.fourkeys.module.gcloud_build_batch_events_handler.null_resource.run_command[0]: Refreshing state... [id=8129959408927395784]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_command[0]: Refreshing state... [id=2671861280509006243]
module.fourkeys.module.gcloud_build_batch_events_handler.null_resource.run_destroy_command[0]: Refreshing state... [id=4793805920311669762]
module.fourkeys.google_storage_bucket_iam_member.destination_bucket_access_logs: Refreshing state... [id=b/off-net-dev-gh-audit-log-archieve-local/roles/storage.admin/serviceAccount:project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.google_cloud_run_service_iam_member.unauthenticated_invoker: Refreshing state... [id=v1/projects/off-net-dev/locations/northamerica-northeast1/services/batch-events-handler/roles/run.invoker/allUsers]
module.fourkeys.google_storage_bucket.events_archieve_local: Refreshing state... [id=off-net-dev-events-archieve-local]
module.fourkeys.google_storage_bucket.gh_audit_log_archieve_local: Refreshing state... [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.google_cloud_run_service.batch_events_handler: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-handler]
module.fourkeys.google_storage_bucket.dump_logs: Refreshing state... [id=off-net-dev-batch-gh-audit-logs]
module.fourkeys.google_storage_bucket.batch_gh_log_function_bucket: Refreshing state... [id=off-net-dev-batch-gh-log-function]
module.fourkeys.google_cloud_run_service.batch_logs_bq_writer_demo: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer-demo]
module.fourkeys.google_storage_bucket.gh_audit_log_station_local: Refreshing state... [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.google_cloud_run_service.batch_events_bq_writer: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer]
module.fourkeys.google_storage_bucket_iam_member.source_bucket_access_logs: Refreshing state... [id=b/off-net-dev-gh-audit-log-station-local/roles/storage.admin/serviceAccount:project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.data.google_storage_bucket.gh_audit_log_archieve_local: Reading...
module.fourkeys.data.google_project.project: Reading...
module.fourkeys.data.google_storage_transfer_project_service_account.logs: Reading...
module.fourkeys.google_storage_bucket.function_bucket: Refreshing state... [id=off-net-dev-function-gh-log-source]
module.fourkeys.google_storage_bucket.events_station_local: Refreshing state... [id=off-net-dev-events-station-local]
module.fourkeys.google_bigquery_dataset.dataset: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys]
module.fourkeys.google_service_account.unleash_sa: Refreshing state... [id=projects/off-net-dev/serviceAccounts/unleash-sa@off-net-dev.iam.gserviceaccount.com]
module.fourkeys.data.google_storage_bucket.gh_audit_log_station_local: Reading...
module.fourkeys.google_eventarc_trigger.primary: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/name]
module.fourkeys.google_eventarc_trigger.gh_logs_trigger_demo: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/gh-logs-trigger-demo]
module.fourkeys.data.google_storage_transfer_project_service_account.logs: Read complete after 0s [id=project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.google_storage_transfer_job.batch_logs_transfer_job: Refreshing state... [id=off-net-dev/2870788994826366552]
module.fourkeys.data.google_storage_bucket.gh_audit_log_archieve_local: Read complete after 0s [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.google_storage_bucket_object.load_gh_audit_log_zip: Refreshing state... [id=off-net-dev-function-gh-log-source-src-6638472b3dc9ee579dea7de9b53921b5.zip]
module.fourkeys.google_bigquery_table.batch_logs: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_logs]
module.fourkeys.google_bigquery_table.batch_events: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_events]
module.fourkeys.data.google_storage_bucket.gh_audit_log_station_local: Read complete after 1s [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.google_cloudfunctions2_function.event_function: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/functions/batch-gh-log-handler-2]
module.fourkeys.data.google_project.project: Read complete after 1s [id=projects/off-net-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.fourkeys.google_cloud_run_service.batch_events_bq_writer will be updated in-place
  ~ resource "google_cloud_run_service" "batch_events_bq_writer" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer"
        name                       = "batch-events-bq-writer"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_cloud_run_service.batch_events_handler will be destroyed
  # (because google_cloud_run_service.batch_events_handler is not in configuration)
  - resource "google_cloud_run_service" "batch_events_handler" {
      - autogenerate_revision_name = true -> null
      - id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-handler" -> null
      - location                   = "northamerica-northeast1" -> null
      - name                       = "batch-events-handler" -> null
      - project                    = "off-net-dev" -> null
      - status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "Ready"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "ConfigurationsReady"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "batch-events-handler-00001-vdn"
              - latest_ready_revision_name   = "batch-events-handler-00001-vdn"
              - observed_generation          = 1
              - traffic                      = [
                  - {
                      - latest_revision = true
                      - percent         = 100
                      - revision_name   = "batch-events-handler-00001-vdn"
                      - tag             = ""
                      - url             = ""
                    },
                ]
              - url                          = "https://batch-events-handler-xr5qbdt42a-nn.a.run.app"
            },
        ] -> null

      - metadata {
          - annotations           = {} -> null
          - effective_annotations = {
              - "run.googleapis.com/ingress"        = "all"
              - "run.googleapis.com/ingress-status" = "all"
              - "run.googleapis.com/operation-id"   = "7a586f95-643f-498f-8afe-eccaec4b847a"
              - "serving.knative.dev/creator"       = "dora-wif@off-net-dev.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier"  = "dora-wif@off-net-dev.iam.gserviceaccount.com"
            } -> null
          - effective_labels      = {
              - "cloud.googleapis.com/location" = "northamerica-northeast1"
            } -> null
          - generation            = 1 -> null
          - labels                = {} -> null
          - namespace             = "off-net-dev" -> null
          - resource_version      = "AAYTjwD7I7M" -> null
          - self_link             = "/apis/serving.knative.dev/v1/namespaces/541105984323/services/batch-events-handler" -> null
          - terraform_labels      = {} -> null
          - uid                   = "c49f7940-f8db-49b9-830e-7d1f6605a771" -> null
        }

      - template {
          - metadata {
              - annotations = {
                  - "autoscaling.knative.dev/maxScale" = "100"
                  - "autoscaling.knative.dev/minScale" = "1"
                  - "client.knative.dev/user-image"    = "northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/batch_events_handler_container_url:d2c3770ca6aa2cb76ae14c2c515a686517dcc6ff"
                  - "run.googleapis.com/client-name"   = "cloud-console"
                } -> null
              - generation  = 0 -> null
              - labels      = {
                  - "run.googleapis.com/startupProbeType" = "Default"
                } -> null
            }
          - spec {
              - container_concurrency = 80 -> null
              - service_account_name  = "dora-wif@off-net-dev.iam.gserviceaccount.com" -> null
              - timeout_seconds       = 300 -> null

              - containers {
                  - args    = [] -> null
                  - command = [] -> null
                  - image   = "northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/batch_events_handler_container_url:d2c3770ca6aa2cb76ae14c2c515a686517dcc6ff" -> null

                  - env {
                      - name  = "project-name" -> null
                      - value = "off-net-dev" -> null
                    }

                  - ports {
                      - container_port = 8080 -> null
                      - name           = "http1" -> null
                    }

                  - resources {
                      - limits   = {
                          - "cpu"    = "1000m"
                          - "memory" = "1024Mi"
                        } -> null
                      - requests = {} -> null
                    }

                  - startup_probe {
                      - failure_threshold     = 1 -> null
                      - initial_delay_seconds = 0 -> null
                      - period_seconds        = 240 -> null
                      - timeout_seconds       = 240 -> null

                      - tcp_socket {
                          - port = 8080 -> null
                        }
                    }
                }
            }
        }

      - traffic {
          - latest_revision = true -> null
          - percent         = 100 -> null
        }
    }

  # module.fourkeys.google_cloud_run_service.batch_events_handler_reload will be created
  + resource "google_cloud_run_service" "batch_events_handler_reload" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "batch-events-handler-reload"
      + project                    = "off-net-dev"
      + status                     = (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/minScale" = "1"
                  + "client.knative.dev/user-image"    = "northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/batch_events_handler_gar_url:d2c3770ca6aa2cb76ae14c2c515a686517dcc6ff"
                  + "run.googleapis.com/client-name"   = "cloud-console"
                }
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "dora-wif@off-net-dev.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/batch_events_handler_gar_url:d2c3770ca6aa2cb76ae14c2c515a686517dcc6ff"
                  + name  = (known after apply)

                  + env {
                      + name  = "project-name"
                      + value = "off-net-dev"
                    }

                  + resources {
                      + limits = {
                          + "memory" = "1024Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.fourkeys.google_cloud_run_service.batch_logs_bq_writer_demo will be updated in-place
  ~ resource "google_cloud_run_service" "batch_logs_bq_writer_demo" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer-demo"
        name                       = "batch-logs-bq-writer-demo"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_cloud_run_service_iam_member.unauthenticated_invoker will be destroyed
  # (because google_cloud_run_service_iam_member.unauthenticated_invoker is not in configuration)
  - resource "google_cloud_run_service_iam_member" "unauthenticated_invoker" {
      - etag     = "BwYTj9lpxw4=" -> null
      - id       = "v1/projects/off-net-dev/locations/northamerica-northeast1/services/batch-events-handler/roles/run.invoker/allUsers" -> null
      - location = "northamerica-northeast1" -> null
      - member   = "allUsers" -> null
      - project  = "off-net-dev" -> null
      - role     = "roles/run.invoker" -> null
      - service  = "v1/projects/off-net-dev/locations/northamerica-northeast1/services/batch-events-handler" -> null
    }

  # module.fourkeys.google_cloudfunctions2_function.event_function will be updated in-place
  ~ resource "google_cloudfunctions2_function" "event_function" {
        id               = "projects/off-net-dev/locations/northamerica-northeast1/functions/batch-gh-log-handler-2"
        name             = "batch-gh-log-handler-2"
        # (10 unchanged attributes hidden)

      ~ build_config {
          - docker_repository     = "projects/off-net-dev/locations/northamerica-northeast1/repositories/gcf-artifacts" -> null
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ event_trigger {
          - retry_policy          = "RETRY_POLICY_DO_NOT_RETRY" -> null
          - trigger_region        = "northamerica-northeast1" -> null
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.fourkeys.google_iam_workload_identity_pool.pool will be created
  + resource "google_iam_workload_identity_pool" "pool" {
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "off-net-dev"
      + state                     = (known after apply)
      + workload_identity_pool_id = "unleash-pool"
    }

  # module.fourkeys.google_iam_workload_identity_pool_provider.provider will be created
  + resource "google_iam_workload_identity_pool_provider" "provider" {
      + attribute_mapping                  = {
          + "attribute.actor"      = "assertion.actor"
          + "attribute.aud"        = "assertion.aud"
          + "attribute.repository" = "assertion.repository"
          + "google.subject"       = "assertion.sub"
        }
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "off-net-dev"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "unleash-pool"
      + workload_identity_pool_provider_id = "unleash-provider"

      + oidc {
          + issuer_uri = "https://token.actions.githubusercontent.com"
        }
    }

  # module.fourkeys.google_project_iam_binding.workload will be created
  + resource "google_project_iam_binding" "workload" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:unleash-sa@off-net-dev.iam.gserviceaccount.com",
        ]
      + project = "off-net-dev"
      + role    = "roles/iam.workloadIdentityUser"
    }

  # module.fourkeys.google_project_iam_binding.writer will be created
  + resource "google_project_iam_binding" "writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:unleash-sa@off-net-dev.iam.gserviceaccount.com",
        ]
      + project = "off-net-dev"
      + role    = "roles/artifactregistry.writer"
    }

  # module.fourkeys.module.gcloud_build_batch_events_handler.null_resource.run_command[0] must be replaced
-/+ resource "null_resource" "run_command" {
      ~ id       = "8129959408927395784" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "arguments"             = "bcffb2a5764f46c6be50b82e958b3091" -> "6c445ae0c7984ce38c66fe82ae7aac80"
          ~ "create_cmd_body"       = "builds submit ../batch_events_handler --tag=northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/batch_events_handler_container_url:d2c3770ca6aa2cb76ae14c2c515a686517dcc6ff --project=off-net-dev --gcs-log-dir=gs://tf-cloud-build-logs" -> "builds submit ../batch_events_handler --tag=northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/batch_events_handler_gar_url:d2c3770ca6aa2cb76ae14c2c515a686517dcc6ff --project=off-net-dev --gcs-log-dir=gs://tf-batch-events-hanlder-logs"
            # (3 unchanged elements hidden)
        }
    }

  # module.fourkeys.module.gcloud_build_batch_events_handler.null_resource.run_destroy_command[0] must be replaced
-/+ resource "null_resource" "run_destroy_command" {
      ~ id       = "4793805920311669762" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "destroy_cmd_body"       = "container images delete northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/batch_events_handler_container_url:d2c3770ca6aa2cb76ae14c2c515a686517dcc6ff --quiet" -> "container images delete northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/batch_events_handler_gar_url:d2c3770ca6aa2cb76ae14c2c515a686517dcc6ff --quiet"
            # (2 unchanged elements hidden)
        }
    }

Plan: 7 to add, 3 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*